podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/LPC13xx.svd.xml
						</field>
						<field>
							<name>START</name>
							<description>When the BURST bit is 0, these bits control whether and when an A/D conversion is started:</description>
							<bitRange>[26:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_START_THIS_VALUE</name>
									<description>No start (this value should be used when clearing PDN to 0).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOW</name>
									<description>Start conversion now.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGEPIO0_2</name>
									<description>Start conversion when the edge selected by bit 27 occurs on PIO0_2/SSEL/CT16B0_CAP0.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGEPIO1_5</name>
									<description>Start conversion when the edge selected by bit 27 occurs on PIO1_5/DIR/CT32B0_CAP0.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE CT32B0_MAT0</name>
									<description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT0. Timer match function does not need to be selected on the device pin.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE CT32B1_MAT0</name>
									<description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT1. Timer match function does not need to be selected on the device pin.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE CT16B0_MAT0</name>
									<description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT0. Timer match function does not need to be selected on the device pin.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EDGE CT16B0_MAT0</name>
									<description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT1. Timer match function does not need to be selected on the device pin.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>This bit is significant only when the START field contains 010-111. In these cases:</description>
							<bitRange>[27:27]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RISING</name>
									<description>Start conversion on a rising edge on the selected CAP/MAT signal.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>Start conversion on a falling edge on the selected CAP/MAT signal.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:28]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>GDR</name>
					<description>A/D Global Data Register. Contains the result of the most recent A/D conversion.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>V_VREF</name>
							<description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin selected by the SEL field, divided by the voltage on the VDD pin. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VSS, while 0x3FF indicates that the voltage on ADn was close to, equal to, or greater than that on VREF.</description>
							<bitRange>[15:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>CHN</name>
							<description>These bits contain the channel from which the V_VREF bits were converted.</description>
							<bitRange>[26:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[29:27]</bitRange>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DONE</name>
							<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read and when the ADCR is written. If the ADCR is written while a conversion is still in progress, this bit is set and a new conversion is started.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN</name>
					<description>A/D Interrupt Enable Register. This register contains enable bits that allow the DONE flag of each A/D channel to be included or excluded from contributing to the generation of an A/D interrupt.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000100</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADINTEN0</name>
							<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ADINTEN1</name>
							<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ADINTEN2</name>
							<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ADINTEN3</name>
							<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ADINTEN4</name>
							<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ADINTEN5</name>
							<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ADINTEN6</name>
							<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>ADINTEN7</name>
							<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ADGINTEN</name>
							<description>When 1, enables the global DONE flag in ADDR to generate an interrupt. When 0, only the individual A/D channels enabled by ADINTEN 7:0 will generate interrupts.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>DR%s</name>
					<description>A/D Channel n Data
Register. This register contains the result of the most recent conversion
completed on channel n</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>V_VREF</name>
							<description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin, divided by the voltage on the VREF pin. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VREF, while 0x3FF indicates that the voltage on AD input was close to, equal to, or greater than that on VREF.</description>
							<bitRange>[15:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[29:16]</bitRange>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the V_VREF bits.This bit is cleared by reading this register.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DONE</name>
							<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>A/D Status Register. This register contains DONE and OVERRUN flags for all of the A/D channels, as well as the A/D interrupt flag.</description>
					<addressOffset>0x030</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DONE0</name>
							<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DONE1</name>
							<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>DONE2</name>
							<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DONE3</name>
							<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DONE4</name>
							<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>DONE5</name>
							<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>DONE6</name>
							<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>DONE7</name>
							<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>OVERRUN0</name>
							<description>These bits mirror the OVERRRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>OVERRUN1</name>
							<description>These bits mirror the OVERRRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>OVERRUN2</name>
							<description>These bits mirror the OVERRRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>OVERRUN3</name>
							<description>These bits mirror the OVERRRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>OVERRUN4</name>
							<description>These bits mirror the OVERRRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>OVERRUN5</name>
							<description>These bits mirror the OVERRRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>OVERRUN6</name>
							<description>These bits mirror the OVERRRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>OVERRUN7</name>
							<description>These bits mirror the OVERRRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>ADINT</name>
							<description>This bit is the A/D interrupt flag. It is one when any of the individual A/D channel Done flags is asserted and enabled to contribute to the A/D interrupt via the ADINTEN register.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:17]</bitRange>
						</field>
					</fields>
				</register>
