podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/LPC13xx.svd.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>USB</name>
			<description>Product name title=UM10375 Chapter title=LPC13xx USB device
controller Modification date=4/20/2011 Major revision=2 Minor revision=1 </description>
			<groupName>USB</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USBIRQ</name>
				<value>47</value>
			</interrupt>
			<interrupt>
				<name>USBFIQ</name>
				<value>48</value>
			</interrupt>
			<registers>
				<register>
					<name>DEVINTST</name>
					<description>USB Device Interrupt Status</description>
					<addressOffset>0x00</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000010</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAME</name>
							<description>The frame interrupt occurs every 1 ms. This is used in isochronous packet transfers. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EP0</name>
							<description>USB core interrupt for physical endpoint 0. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EP1</name>
							<description>USB core interrupt for physical endpoint 1. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EP2</name>
							<description>USB core interrupt for physical endpoint 2. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EP3</name>
							<description>USB core interrupt for physical endpoint 3. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EP4</name>
							<description>USB core interrupt for physical endpoint 4. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>EP5</name>
							<description>USB core interrupt for physical endpoint 5. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>EP6</name>
							<description>USB core interrupt for physical endpoint 6. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EP7</name>
							<description>USB core interrupt for physical endpoint 7. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DEV_STAT</name>
							<description>Set when USB Bus reset, USB suspend change, or Connect change event occurs. Refer to Section 10.11.7. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CC_EMPTY</name>
							<description>The command code register (USBCmdCode) is empty (New command can be written). 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CD_FULL</name>
							<description>Command data register (USBCmdData) is full (Data can be read now). 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RxENDPKT</name>
							<description>The current packet in the endpoint buffer is transferred to the CPU. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>TxENDPKT</name>
							<description>The number of data bytes transferred to the endpoint buffer equals the number of bytes programmed in the TxPacket length register (USBTxPLen). 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:14]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVINTEN</name>
					<description>USB Device Interrupt Enable</description>
					<addressOffset>0x04</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAME_EN</name>
							<description>Frame interrupt . For isochronous packet transfers. 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EP0_EN</name>
							<description>USB core interrupt for physical endpoint 0. 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EP1_EN</name>
							<description>USB core interrupt for physical endpoint 1. 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EP2_EN</name>
							<description>USB core interrupt for physical endpoint 2. 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EP3_EN</name>
							<description>USB core interrupt for physical endpoint 3. 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EP4_EN</name>
							<description>USB core interrupt for physical endpoint 4. 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>EP5_EN</name>
							<description>USB core interrupt for physical endpoint 5. 0 = no interrupt. 1 = interrupt pending.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>EP6_EN</name>
							<description>USB core interrupt for physical endpoint 6. 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EP7_EN</name>
							<description>USB core interrupt for physical endpoint 7. 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DEV_STAT_EN</name>
							<description>Set when USB Bus reset, USB suspend change, or Connect change event occurs.  0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CC_EMPTY_EN</name>
							<description>The command code register (USBCmdCode) is empty (New command can be written). 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CD_FULL_EN</name>
							<description>Command data register (USBCmdData) is full (Data can be read now). 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RXENDPKT_EN</name>
							<description>The current packet in the endpoint buffer is transferred to the CPU. 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>TXENDPKT_EN</name>
							<description>The number of data bytes transferred to the endpoint buffer equals the number of bytes programmed in the TxPacket length register (USBTxPLen). 0 = no interrupt generated. 1 = interrupt generated when the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:14]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVINTCTRL</name>
					<description>USB Device Interrupt Clear</description>
					<addressOffset>0x08</addressOffset>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAME_CLR</name>
							<description>Frame interrupt . For isochronous packet transfers. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EP0_CLR</name>
							<description>USB core interrupt for physical endpoint 0. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EP1_CLR</name>
							<description>USB core interrupt for physical endpoint 1. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EP2_CLR</name>
							<description>USB core interrupt for physical endpoint 2. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EP3_CLR</name>
							<description>USB core interrupt for physical endpoint 3. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EP4_CLR</name>
							<description>USB core interrupt for physical endpoint 4. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>EP5_CLR</name>
							<description>USB core interrupt for physical endpoint 5. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>EP6_CLR</name>
							<description>USB core interrupt for physical endpoint 6. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EP7_CLR</name>
							<description>USB core interrupt for physical endpoint 7. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DEV_STAT_CLR</name>
							<description>Set when USB Bus reset, USB suspend change, or Connect change event occurs.  0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CC_EMPTY_CLR</name>
							<description>The command code register (USBCmdCode) is empty (New command can be written). 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CD_FULL_CLR</name>
							<description>Command data register (USBCmdData) is full (Data can be read now). 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RXENDPKT_CLR</name>
							<description>The current packet in the endpoint buffer is transferred to the CPU. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>TXENDPKT_CLR</name>
							<description>The number of data bytes transferred to the endpoint buffer equals the number of bytes programmed in the TxPacket length register (USBTxPLen). 0 = no effect. 1 = the corresponding bit in USBDevIntSt is cleared.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:14]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVINTSET</name>
					<description>USB Device Interrupt Set</description>
					<addressOffset>0x0C</addressOffset>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAME_SET</name>
							<description>Frame interrupt . For isochronous packet transfers. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EP0_SET</name>
							<description>USB core interrupt for physical endpoint 0. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EP1_SET</name>
							<description>USB core interrupt for physical endpoint 1. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EP2_SET</name>
							<description>USB core interrupt for physical endpoint 2. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EP3_SET</name>
							<description>USB core interrupt for physical endpoint 3. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>EP4_SET</name>
							<description>USB core interrupt for physical endpoint 4. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>EP5_SET</name>
							<description>USB core interrupt for physical endpoint 5. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>EP6_SET</name>
							<description>USB core interrupt for physical endpoint 6. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>EP7_SET</name>
							<description>USB core interrupt for physical endpoint 7. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DEV_STAT_SET</name>
							<description>Set when USB Bus reset, USB suspend change, or Connect change event occurs.  0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CC_EMPTY_SET</name>
							<description>The command code register (USBCmdCode) is empty (New command can be written). 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CD_FULL_SET</name>
							<description>Command data register (USBCmdData) is full (Data can be read now). 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RXENDPKT_SET</name>
							<description>The current packet in the endpoint buffer is transferred to the CPU. 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>TXENDPKT_SET</name>
							<description>The number of data bytes transferred to the endpoint buffer equals the number of bytes programmed in the TxPacket length register (USBTxPLen). 0 = no effect. 1 = the corresponding bit in USBDevIntSt is set.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:14]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CMDCODE</name>
					<description>USB Command Code</description>
					<addressOffset>0x10</addressOffset>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[7:0]</bitRange>
						
