podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/LPC13xx.svd.xml
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>GPREG%s</name>
					<description>General purpose register </description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GPDATA</name>
							<description>Data retained during Deep power-down mode.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>GPREG4</name>
					<description>General purpose register 4</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[9:0]</bitRange>
						
						</field>
						<field>
							<name>WAKEUPHYS</name>
							<description>WAKEUP pin hysteresis enable</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Hysteresis for WAKUP pin disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Hysteresis for WAKEUP pin enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPDATA</name>
							<description>Data retained during Deep power-down mode.</description>
							<bitRange>[31:11]</bitRange>
						
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>FMC</name>
			<description>Product name title=UM10375 Chapter title=LPC13xx Flash memory
				programming firmware Modification date=4/20/2011 Major revision=2 Minor revision=1 </description>
			<groupName>FMC</groupName>
			<baseAddress>0x4003C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>FLASHCFG</name>
					<description>Flash configuration register</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>FLASHTIM</name>
							<description>Flash memory access time. FLASHTIM +1 is equal to the number of system clocks used for flash access.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>1_SYSTEM_CLOCK_FLASH</name>
									<description>1 system clock flash access time (for system clock frequencies of up to 20 MHz).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_SYSTEM_CLOCKS_FLAS</name>
									<description>2 system clocks flash access time (for system clock frequencies of up to 40 MHz).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_SYSTEM_CLOCKS_FLAS</name>
									<description>3 system clocks flash access time (for system clock frequencies of up to 72 MHz).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED_</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. User software must not change the value of these bits. Bits 31:2 must be written back exactly as read.</description>
							<bitRange>[31:2]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>FMSSTART</name>
					<description>Signature start address register</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>Signature generation start address (corresponds to AHB byte address bits[20:4]).</description>
							<bitRange>[16:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:17]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FMSSTOP</name>
					<description>Signature stop-address register</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STOP</name>
							<description>BIST stop address divided by 16 (corresponds to AHB byte address [20:4]).</description>
							<bitRange>[16:0]</bitRange>
						
						</field>
						<field>
							<name>SIG_START</name>
							<description>Start control bit for signature generation.</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SIGNATURE_GENERATION</name>
									<description>Signature generation is stopped</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INITIATE_SIGNATURE_G</name>
									<description>Initiate signature generation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:18]</bitRange>
						
