podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/LPC13xx.svd.xml
						</field>
					</fields>
				</register>
				<register>
					<name>FMSW0</name>
					<description>Word 0 [31:0]</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SW0_31_0</name>
							<description>Word 0 of 128-bit signature (bits 31 to 0).</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FMSW1</name>
					<description>Word 1 [63:32]</description>
					<addressOffset>0x030</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SW1_63_32</name>
							<description>Word 1 of 128-bit signature (bits 63 to 32).</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FMSW2</name>
					<description>Word 2 [95:64]</description>
					<addressOffset>0x034</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SW2_95_64</name>
							<description>Word 2 of 128-bit signature (bits 95 to 64).</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FMSW3</name>
					<description>Word 3 [127:96]</description>
					<addressOffset>0x038</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SW3_127_96</name>
							<description>Word 3 of 128-bit signature (bits 127 to 96).</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FMSTAT</name>
					<description>Signature generation status register</description>
					<addressOffset>0xFE0</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>SIG_DONE</name>
							<description>When 1, a previously started signature generation has completed. See FMSTATCLR register description for clearing this flag.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FMSTATCLR</name>
					<description>Signature generation status clear register</description>
					<addressOffset>0xFE8</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>SIG_DONE_CLR</name>
							<description>Writing a 1 to this bits clears the signature generation completion flag (SIG_DONE) in the FMSTAT register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>SSP0</name>
			<description>Product name title=UM10375 Chapter title=LPC13xx SSP0/1 Modification date=4/20/2011 Major revision=2 Minor revision=1 </description>
			<groupName>SSP0</groupName>
			<baseAddress>0x40040000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SSP0</name>
				<value>45</value>
			</interrupt>
			<registers>
				<register>
					<name>CR0</name>
					<description>Control Register 0. Selects the serial clock rate, bus type, and data size.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSS</name>
							<description>Data Size Select. This field controls the number of bits transferred in each frame. Values 0000-0010 are not supported and should not be used.</description>
							<bitRange>[3:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>4_BIT_TRANSFER</name>
									<description>4-bit transfer</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_BIT_TRANSFER</name>
									<description>5-bit transfer</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_BIT_TRANSFER</name>
									<description>6-bit transfer</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_BIT_TRANSFER</name>
									<description>7-bit transfer</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_BIT_TRANSFER</name>
									<description>8-bit transfer</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_BIT_TRANSFER</name>
									<description>9-bit transfer</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_BIT_TRANSFER</name>
									<description>10-bit transfer</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>11_BIT_TRANSFER</name>
									<description>11-bit transfer</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12_BIT_TRANSFER</name>
									<description>12-bit transfer</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>13_BIT_TRANSFER</name>
									<description>13-bit transfer</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>14_BIT_TRANSFER</name>
									<description>14-bit transfer</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15_BIT_TRANSFER</name>
									<description>15-bit transfer</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_BIT_TRANSFER</name>
									<description>16-bit transfer</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FRF</name>
							<description>Frame Format.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SPI</name>
									<description>SPI</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TI</name>
									<description>TI</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICROWIRE</name>
									<description>Microwire</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_COMBINATION_IS_</name>
									<description>This combination is not supported and should not be used.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPOL</name>
							<description>Clock Out Polarity. This bit is only used in SPI mode.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>SSP controller maintains the bus clock low between frames.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>SSP controller maintains the bus clock high between frames.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPHA</name>
							<description>Clock Out Phase. This bit is only used in SPI mode.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FIRSTCLOCK</name>
									<description>SSP controller captures serial data on the first clock transition of the frame, that is, the transition away from the inter-frame state of the clock line.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SECONDCLOK</name>
									<description>SSP controller captures serial data on the second clock transition of the frame, that is, the transition back to the inter-frame state of the clock line.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCR</name>
							<description>Serial Clock Rate. The number of prescaler-output clocks per bit on the bus, minus one. Given that CPSDVSR is the prescale divider, and the APB clock PCLK clocks the prescaler, the bit frequency is PCLK / (CPSDVSR x [SCR+1]).</description>
							<bitRange>[15:8]</bitRange>
						
