podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/LPC13xx.svd.xml
			<registers>
				<register>
					<name>SYSMEMREMAP</name>
					<description>System memory remap</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MAP</name>
							<description>System memory remap</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BOOT_LOADER_MODE_IN</name>
									<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USER_RAM_MODE_INTER</name>
									<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USER_FLASH_MODE_INT</name>
									<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRL</name>
					<description>Peripheral reset control</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SSP0_RST_N</name>
							<description>SSP0 reset control</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESET_SSP0_</name>
									<description>Reset SSP0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DE_ASSERT_SSP0_RESET</name>
									<description>De-assert SSP0 reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2C_RST_N</name>
							<description>I2C reset control</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESET_I2C_</name>
									<description>Reset I2C.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DE_ASSET_I2C_RESET_</name>
									<description>De-asset I2C reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSP1_RST_N</name>
							<description>SPISP1 reset control</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESET_THE_SPISP1_</name>
									<description>Reset the SPISP1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DE_ASSERT_SPISP1_RES</name>
									<description>De-assert SPISP1 reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:23]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCTRL</name>
					<description>System PLL control</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSEL</name>
							<description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 11111: Division ratio M = 32.</description>
							<bitRange>[4:0]</bitRange>
						
						</field>
						<field>
							<name>PSEL</name>
							<description>Post divider ratio P. The division ratio is 2 x P.</description>
							<bitRange>[6:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>P_EQ_1</name>
									<description>P = 1</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P_EQ_2</name>
									<description>P = 2</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P_EQ_4</name>
									<description>P = 4</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P_EQ_8</name>
									<description>P = 8</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to reserved bits.</description>
							<bitRange>[31:7]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLSTAT</name>
					<description>System PLL status</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LOCK</name>
							<description>PLL lock status</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PLL_NOT_LOCKED</name>
									<description>PLL not locked</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL_LOCKED</name>
									<description>PLL locked</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:1]</bitRange>
						
