podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/LPC13xx.svd.xml
				<register>
					<name>STARTRSRP1CLR</name>
					<description>Start logic reset register 1; top 8 interrupts</description>
					<addressOffset>0x218</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RSRPIO2_8</name>
							<description>Start signal reset for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Do nothing.. 1 = Write: reset start signal.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_9</name>
							<description>Start signal reset for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Do nothing.. 1 = Write: reset start signal.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_10</name>
							<description>Start signal reset for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Do nothing.. 1 = Write: reset start signal.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RSRPIO2_11</name>
							<description>Start signal reset for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = Do nothing.. 1 = Write: reset start signal.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RSRPIO3_0</name>
							<description>Start signal reset for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Do nothing.. 1 = Write: reset start signal.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RSRPIO3_1</name>
							<description>Start signal reset for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Do nothing.. 1 = Write: reset start signal.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RSRPIO3_2</name>
							<description>Start signal reset for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Do nothing.. 1 = Write: reset start signal.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RSRPIO3_3</name>
							<description>Start signal reset for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = Do nothing.. 1 = Write: reset start signal.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTSRP1</name>
					<description>Start logic status register 1; top 8 interrupts</description>
					<addressOffset>0x21C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SRPIO2_8</name>
							<description>Start signal status for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>SRPIO2_9</name>
							<description>Start signal status for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SRPIO2_10</name>
							<description>Start signal status for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SRPIO2_11</name>
							<description>Start signal status for start logic input PIO2_n (bit 0 = PIO2_8, ..., bit 3 = PIO2_11). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SRPIO3_0</name>
							<description>Start signal status for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SRPIO3_1</name>
							<description>Start signal status for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>SRPIO3_2</name>
							<description>Start signal status for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SRPIO3_3</name>
							<description>Start signal status for start logic input PIO3_n (bit 4 = PIO3_0, ..., bit 7 = PIO3_3). 0 = No start signal received. 1 = Start signal pending.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PDSLEEPCFG</name>
					<description>Power-down states in Deep-sleep mode</description>
					<addressOffset>0x230</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FIXEDVAL0</name>
							<description>Reserved. Always write these bits as 111.</description>
							<bitRange>[2:0]</bitRange>
						
						</field>
						<field>
							<name>BOD_PD</name>
							<description>BOD power-down control in Deep-sleep mode, see Table 49.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>POWERED</name>
									<description>Powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>Powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FIXEDVAL1</name>
							<description>Reserved. Always write these bits as 11.</description>
							<bitRange>[5:4]</bitRange>
						
