podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/LPC13xx.svd.xml
						</field>
						<field>
							<name>USBPAD_PD</name>
							<description>USB pad power-down configuration</description>
							<bitRange>[10:10]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>USB_PHY_POWERED</name>
									<description>USB PHY powered</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USB_PHY_POWERED_DOWN</name>
									<description>USB PHY powered down (suspend mode)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FIXEDVAL1</name>
							<description>Reserved. Always write this bit as 1.</description>
							<bitRange>[11:11]</bitRange>

							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:12]</bitRange>

							
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICE_ID</name>
					<description>Device ID</description>
					<addressOffset>0x3F4</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DEVICEID</name>
							<description>Device ID for LPC13xx parts: 0x2C42 502B = LPC1311FHN33 
								0x2C40 102B = LPC1313FHN33 
								0x2C40 102B = LPC1313FBD48 
								0x3D01 402B = LPC1342FHN33 
								0x3D00 002B = LPC1343FHN33 
								0x3D00 002B = LPC1343FBD48 
								0x1816 902B = LPC1311FHN33/01 
								0x1830 102B = LPC1313FHN33/01 
								0x1830 102B = LPC1313FBD48/01</description>
							<bitRange>[31:0]</bitRange>

						</field>
					</fields>
				</register>


			</registers>
		</peripheral>
		<peripheral derivedFrom="SSP0">
			<name>SSP1</name>
			<baseAddress>0x40058000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SSP1</name>
				<value>57</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>GPIO0</name>
			<description>Product name title=UM10375 Chapter title=LPC13xx General
Purpose I/O (GPIO) Modification date=4/20/2011 Major revision=2 Minor revision=1 </description>
			<groupName>GPIO</groupName>
			<baseAddress>0x50000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PIO_0</name>
				<value>56</value>
			</interrupt>
			<registers>
				<register>
					<name>DATA</name>
					<description>Port n data register for pins PIOn_0 to PIOn_11</description>
					<addressOffset>0x3FFC</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DATA0</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DATA1</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>DATA2</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DATA3</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DATA4</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>DATA5</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>DATA6</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>DATA7</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>DATA8</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DATA9</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>DATA10</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DATA11</name>
							<description>Logic levels for pins PIOn_0 to PIOn_11. HIGH = 1, LOW = 0.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DIR</name>
					<description>Data direction register for port n</description>
					<addressOffset>0x8000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IO0</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>IO1</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>IO2</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>IO3</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>IO4</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>IO5</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>IO6</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>IO7</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>IO8</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>IO9</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>IO10</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>IO11</name>
							<description>Selects pin x as input or output (x = 0 to 11). 0 = Pin PIOn_x is configured as input. 1 = Pin PIOn_x is configured as output.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IS</name>
					<description>Interrupt sense register for port n</description>
					<addressOffset>0x8004</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ISENSE0</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ISENSE1</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ISENSE2</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ISENSE3</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ISENSE4</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ISENSE5</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ISENSE6</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>ISENSE7</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ISENSE8</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>ISENSE9</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>ISENSE10</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>ISENSE11</name>
							<description>Selects interrupt on pin x as level or edge sensitive (x = 0 to 11). 0 = Interrupt on pin PIOn_x is configured as edge sensitive. 1 = Interrupt on pin PIOn_x is configured as level sensitive.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IBE</name>
					<description>Interrupt both edges register for port n</description>
					<addressOffset>0x8008</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IBE0</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>IBE1</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>IBE2</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>IBE3</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>IBE4</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>IBE5</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>IBE6</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>IBE7</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>IBE8</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>IBE9</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>IBE10</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>IBE11</name>
							<description>Selects interrupt on pin x to be triggered on both edges (x = 0 to 11). 0 = Interrupt on pin PIOn_x is controlled through register GPIOIEV. 1 = Both edges on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IEV</name>
					<description>Interrupt event register for port n</description>
					<addressOffset>0x800C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IEV0</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>IEV1</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>IEV2</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>IEV3</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>IEV4</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>IEV5</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>IEV6</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>IEV7</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>IEV8</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>IEV9</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>IEV10</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>IEV11</name>
							<description>Selects interrupt on pin x to be triggered rising or falling edges (x = 0 to 11). 0 = Depending on setting in register GPIOIS (see Table 151), falling edges or LOW level on pin PIOn_x trigger an interrupt. 1 = Depending on setting in register GPIOIS (see Table 151), rising edges or HIGH level on pin PIOn_x trigger an interrupt.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
